lvgl-micropython/lvgl_micropython/micropy_updates/esp32/machine_hw_spi.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2017 "Eric Poulsen" <eric@zyxod.com>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdio.h>
#include <stdint.h>
#include <string.h>

#include "py/runtime.h"
#include "py/stream.h"
#include "py/mphal.h"
#include "extmod/modmachine.h"

#include "driver/spi_master.h"
#include "soc/gpio_sig_map.h"
#include "soc/spi_pins.h"
#include "hal/spi_ll.h"

// SPI mappings by device, naming used by IDF old/new
// upython   | ESP32     | ESP32S2   | ESP32S3 | ESP32C3
// ----------+-----------+-----------+---------+---------
// SPI(id=1) | HSPI/SPI2 | FSPI/SPI2 | SPI2    | SPI2
// SPI(id=2) | VSPI/SPI3 | HSPI/SPI3 | SPI3    | err

// Number of available hardware SPI peripherals.
#if SOC_SPI_PERIPH_NUM > 2
#define MICROPY_HW_SPI_MAX (2)
#else
#define MICROPY_HW_SPI_MAX (1)
#endif

// Default pins for SPI(id=1) aka IDF SPI2, can be overridden by a board
#ifndef MICROPY_HW_SPI1_SCK
// Use IO_MUX pins by default.
// If SPI lines are routed to other pins through GPIO matrix
// routing adds some delay and lower limit applies to SPI clk freq
#define MICROPY_HW_SPI1_SCK SPI2_IOMUX_PIN_NUM_CLK
#define MICROPY_HW_SPI1_MOSI SPI2_IOMUX_PIN_NUM_MOSI
#define MICROPY_HW_SPI1_MISO SPI2_IOMUX_PIN_NUM_MISO
#endif

#ifndef MICROPY_HW_SPI1_CS
#define MICROPY_HW_SPI1_CS SPI2_IOMUX_PIN_NUM_CS
#endif

// Default pins for SPI(id=2) aka IDF SPI3, can be overridden by a board
#ifndef MICROPY_HW_SPI2_SCK
#if CONFIG_IDF_TARGET_ESP32
// ESP32 has IO_MUX pins for VSPI/SPI3 lines, use them as defaults
#define MICROPY_HW_SPI2_SCK SPI3_IOMUX_PIN_NUM_CLK      // pin 18
#define MICROPY_HW_SPI2_MOSI SPI3_IOMUX_PIN_NUM_MOSI    // pin 23
#define MICROPY_HW_SPI2_MISO SPI3_IOMUX_PIN_NUM_MISO    // pin 19
#elif CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3
// ESP32S2 and S3 uses GPIO matrix for SPI3 pins, no IO_MUX possible
// Set defaults to the pins used by SPI2 in Octal mode
#define MICROPY_HW_SPI2_SCK SPI2_IOMUX_PIN_NUM_CLK_OCT
#define MICROPY_HW_SPI2_MOSI SPI2_IOMUX_PIN_NUM_MOSI_OCT
#define MICROPY_HW_SPI2_MISO SPI2_IOMUX_PIN_NUM_MISO_OCT
#endif
#endif

#ifdef MICROPY_HW_SPI2_SCK
#ifndef MICROPY_HW_SPI2_CS
#if CONFIG_IDF_TARGET_ESP32
#define MICROPY_HW_SPI2_CS SPI3_IOMUX_PIN_NUM_CS
#elif CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3
#define MICROPY_HW_SPI2_CS SPI2_IOMUX_PIN_NUM_CS_OCT
#endif
#endif
#endif

#define MP_HW_SPI_MAX_XFER_BYTES (4092)
#define MP_HW_SPI_MAX_XFER_BITS (MP_HW_SPI_MAX_XFER_BYTES * 8) // Has to be an even multiple of 8

typedef struct _machine_hw_spi_default_pins_t {
    int8_t sck;
    int8_t mosi;
    int8_t miso;
    int8_t cs;
} machine_hw_spi_default_pins_t;


typedef struct _machine_hw_spi_bus_obj_t {
    spi_host_device_t host;
    int8_t sck;
    int8_t mosi;
    int8_t miso;
    int8_t active_devices;
    enum {
        MACHINE_HW_SPI_STATE_NONE,
        MACHINE_HW_SPI_STATE_INIT,
        MACHINE_HW_SPI_STATE_DEINIT
    } state;

} machine_hw_spi_bus_obj_t;


typedef struct _machine_hw_spi_obj_t {
    mp_obj_base_t base;
    uint32_t baudrate;
    uint8_t polarity;
    uint8_t phase;
    uint8_t bits;
    uint8_t firstbit;
    int8_t cs;
    spi_device_handle_t spi_device;
    machine_hw_spi_bus_obj_t *spi_bus;
} machine_hw_spi_obj_t;


// Default pin mappings for the hardware SPI instances
static const machine_hw_spi_default_pins_t machine_hw_spi_default_pins[MICROPY_HW_SPI_MAX] = {
    { .sck = MICROPY_HW_SPI1_SCK, .mosi = MICROPY_HW_SPI1_MOSI, .miso = MICROPY_HW_SPI1_MISO, .cs = MICROPY_HW_SPI1_CS},
    #ifdef MICROPY_HW_SPI2_SCK
    { .sck = MICROPY_HW_SPI2_SCK, .mosi = MICROPY_HW_SPI2_MOSI, .miso = MICROPY_HW_SPI2_MISO, .cs = MICROPY_HW_SPI2_CS },
    #endif
};

// Static objects mapping to SPI2 (and SPI3 if available) hardware peripherals.
static machine_hw_spi_bus_obj_t machine_hw_spi_obj[MICROPY_HW_SPI_MAX];

static void machine_hw_spi_deinit_internal(machine_hw_spi_obj_t *self) {
    switch (spi_bus_remove_device(self->spi_device)) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("invalid configuration"));
            return;

        case ESP_ERR_INVALID_STATE:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("SPI device already freed"));
            return;
    }

    if (self->cs != -1) {
        esp_rom_gpio_pad_select_gpio(self->cs);
        esp_rom_gpio_connect_out_signal(self->cs, SIG_GPIO_OUT_IDX, false, false);
        gpio_set_direction(self->cs, GPIO_MODE_INPUT);
    }

    self->spi_bus->active_devices--;

    if (self->spi_bus->active_devices < 0) {
        self->spi_bus->state = MACHINE_HW_SPI_STATE_DEINIT;
        self->spi_bus->active_devices = 0;
        return;
    } else if (self->spi_bus->active_devices == 0) {
        switch (spi_bus_free(self->spi_bus->host)) {
            case ESP_ERR_INVALID_ARG:
                mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("invalid configuration"));
                return;

            case ESP_ERR_INVALID_STATE:
                mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("SPI bus already freed"));
                return;
        }

        int8_t pins[3] = {self->spi_bus->miso, self->spi_bus->mosi, self->spi_bus->sck};

        for (int i = 0; i < 3; i++) {
            if (pins[i] != -1) {
                esp_rom_gpio_pad_select_gpio(pins[i]);
                esp_rom_gpio_connect_out_signal(pins[i], SIG_GPIO_OUT_IDX, false, false);
                gpio_set_direction(pins[i], GPIO_MODE_INPUT);
            }
        }

        self->spi_bus->state = MACHINE_HW_SPI_STATE_DEINIT;
    }
}


static void machine_hw_spi_deinit(mp_obj_base_t *self_in) {
    machine_hw_spi_obj_t *self = (machine_hw_spi_obj_t *)self_in;
    machine_hw_spi_deinit_internal(self);
}

static mp_uint_t gcd(mp_uint_t x, mp_uint_t y) {
    while (x != y) {
        if (x > y) {
            x -= y;
        } else {
            y -= x;
        }
    }
    return x;
}

static void machine_hw_spi_transfer(mp_obj_base_t *self_in, size_t len, const uint8_t *src, uint8_t *dest) {
    machine_hw_spi_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (self->spi_bus->state == MACHINE_HW_SPI_STATE_DEINIT) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("transfer on deinitialized SPI"));
        return;
    }
    spi_device_acquire_bus(self->spi_device, portMAX_DELAY);

    // Round to nearest whole set of bits
    int bits_to_send = len * 8 / self->bits * self->bits;

    if (!bits_to_send) {
        mp_raise_ValueError(MP_ERROR_TEXT("buffer too short"));
    }

    if (len <= 4) {
        spi_transaction_t transaction = { 0 };

        if (src != NULL) {
            memcpy(&transaction.tx_data, src, len);
        }

        transaction.flags = SPI_TRANS_USE_TXDATA | SPI_TRANS_USE_RXDATA;
        transaction.length = bits_to_send;
        spi_device_transmit(self->spi_device, &transaction);

        if (dest != NULL) {
            memcpy(dest, &transaction.rx_data, len);
        }
    } else {
        int offset = 0;
        int bits_remaining = bits_to_send;
        int optimum_word_size = 8 * self->bits / gcd(8, self->bits);
        int max_transaction_bits = SPI_LL_DMA_MAX_BIT_LEN / optimum_word_size * optimum_word_size;
        spi_transaction_t *transaction, *result, transactions[2];
        int i = 0;


        while (bits_remaining) {
            transaction = transactions + i++ % 2;
            memset(transaction, 0, sizeof(spi_transaction_t));

            if (bits_remaining > max_transaction_bits) {
                transaction->length = max_transaction_bits;
                transaction->flags |= SPI_TRANS_CS_KEEP_ACTIVE;
            } else {
                transaction->length = bits_remaining;
            }

            if (src != NULL) {
                transaction->tx_buffer = src + offset;
                transaction->flags |= SPI_TRANS_USE_TXDATA;
            }
            if (dest != NULL) {
                transaction->rx_buffer = dest + offset;
                transaction->flags |= SPI_TRANS_USE_RXDATA;
            }

            spi_device_queue_trans(self->spi_device, transaction, portMAX_DELAY);
            bits_remaining -= transaction->length;

            if (offset > 0) {
                // wait for previously queued transaction
                MP_THREAD_GIL_EXIT();
                spi_device_get_trans_result(self->spi_device, &result, portMAX_DELAY);
                MP_THREAD_GIL_ENTER();
            }

            // doesn't need ceil(); loop ends when bits_remaining is 0
            offset += transaction->length / 8;
        }

        // wait for last transaction
        MP_THREAD_GIL_EXIT();
        spi_device_get_trans_result(self->spi_device, &result, portMAX_DELAY);
        MP_THREAD_GIL_ENTER();
        spi_device_release_bus(self->spi_device);
    }

    spi_device_release_bus(self->spi_device);

}

/******************************************************************************/
// MicroPython bindings for hw_spi

static void machine_hw_spi_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_hw_spi_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print, "SPI(id=%u, baudrate=%u, polarity=%u, phase=%u, bits=%u, firstbit=%u, sck=%d, mosi=%d, miso=%d, cs=%d)",
        self->spi_bus->host, self->baudrate, self->polarity,
        self->phase, self->bits, self->firstbit,
        self->spi_bus->sck, self->spi_bus->mosi, self->spi_bus->miso, self->cs);
}


static void machine_hw_spi_init(mp_obj_base_t *self_in, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {

}


mp_obj_t machine_hw_spi_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

    enum { ARG_id, ARG_baudrate, ARG_polarity, ARG_phase, ARG_bits, ARG_firstbit, ARG_sck, ARG_mosi, ARG_miso, ARG_cs};
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_id,       MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_baudrate, MP_ARG_INT, {.u_int = 500000} },
        { MP_QSTR_polarity, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_phase,    MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_bits,     MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 8} },
        { MP_QSTR_firstbit, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = MICROPY_PY_MACHINE_SPI_MSB} },
        { MP_QSTR_sck,      MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_mosi,     MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_miso,     MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_cs,       MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    machine_hw_spi_obj_t *self = m_new_obj(machine_hw_spi_obj_t);

    machine_hw_spi_bus_obj_t *spi_bus;
    const machine_hw_spi_default_pins_t *default_pins;

    mp_int_t spi_id = args[ARG_id].u_int;
    if (1 <= spi_id && spi_id <= MICROPY_HW_SPI_MAX) {
        spi_bus = &machine_hw_spi_obj[spi_id - 1];
        default_pins = &machine_hw_spi_default_pins[spi_id - 1];
    } else {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) doesn't exist"), spi_id);
        return mp_const_none;
    }

    self->base.type = &machine_spi_type;
    self->spi_bus = spi_bus;

    int8_t sck, mosi, miso, cs;

    if (args[ARG_sck].u_obj == MP_OBJ_NULL) {
        sck = default_pins->sck;
    } else if (args[ARG_sck].u_obj == mp_const_none) {
        sck = -1;
    } else {
        sck = machine_pin_get_id(args[ARG_sck].u_obj);
    }

    if (args[ARG_mosi].u_obj == MP_OBJ_NULL) {
        mosi = default_pins->mosi;
    } else if (args[ARG_mosi].u_obj == mp_const_none) {
        mosi = -1;
    } else {
        mosi = machine_pin_get_id(args[ARG_mosi].u_obj);
    }

    if (args[ARG_miso].u_obj == MP_OBJ_NULL) {
        miso = default_pins->miso;
    } else if (args[ARG_miso].u_obj == mp_const_none) {
        miso = -1;
    } else {
        miso = machine_pin_get_id(args[ARG_miso].u_obj);
    }

    if (args[ARG_cs].u_obj == MP_OBJ_NULL) {
        cs = -1;
    } else if (args[ARG_cs].u_obj == mp_const_none) {
        cs = default_pins->cs;
    } else {
        cs = machine_pin_get_id(args[ARG_cs].u_obj);
    }

    esp_err_t ret;

    if (self->spi_bus->state == MACHINE_HW_SPI_STATE_INIT) {
        if (self->spi_bus->sck != sck || self->spi_bus->miso != miso || self->spi_bus->mosi != mosi) {
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("bus already initilized using different pins"));
            return mp_const_none;
        }
    } else {
        self->spi_bus->host = args[ARG_id].u_int;
        self->spi_bus->miso = miso;
        self->spi_bus->mosi = mosi;
        self->spi_bus->sck = sck;

        spi_bus_config_t buscfg = {
            .miso_io_num = miso,
            .mosi_io_num = mosi,
            .sclk_io_num = sck,
            .quadwp_io_num = -1,
            .quadhd_io_num = -1,
            .max_transfer_sz = SPI_LL_DMA_MAX_BIT_LEN / 8
        };

        #if CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3
        ret = spi_bus_initialize(self->spi_bus->host, &buscfg, SPI_DMA_CH_AUTO);
        #else
        if (self->spi_bus->host == SPI2_HOST) {
            ret = spi_bus_initialize(self->spi_bus->host, &buscfg, 1);
        } else {
            ret = spi_bus_initialize(self->spi_bus->host, &buscfg, 2);
        }
        #endif

        switch (ret) {
            case ESP_ERR_INVALID_ARG:
                mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("invalid configuration"));
                return mp_const_none;

            case ESP_ERR_INVALID_STATE:
                break;
        }

        self->spi_bus->state = MACHINE_HW_SPI_STATE_INIT;
    }

    self->baudrate = spi_get_actual_clock(APB_CLK_FREQ, args[ARG_baudrate].u_int, 0);
    self->phase = args[ARG_phase].u_int;
    self->polarity = args[ARG_polarity].u_int;
    self->firstbit = args[ARG_firstbit].u_int;
    self->bits = args[ARG_bits].u_int;
    self->cs = cs;

    spi_device_interface_config_t devcfg = {
        .clock_speed_hz = self->baudrate,
        .mode = self->phase | (self->polarity << 1),
        .spics_io_num = cs, // No CS pin
        .queue_size = 2,
        .flags = self->firstbit == MICROPY_PY_MACHINE_SPI_LSB ? SPI_DEVICE_TXBIT_LSBFIRST | SPI_DEVICE_RXBIT_LSBFIRST : 0,
        .pre_cb = NULL
    };

    ret = spi_bus_add_device(self->spi_bus->host, &devcfg, &self->spi_device);
    switch (ret) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("invalid configuration"));
            return mp_const_none;

        case ESP_ERR_NO_MEM:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("out of memory"));
            return mp_const_none;

        case ESP_ERR_NOT_FOUND:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("no free slots"));
            return mp_const_none;
    }

    self->spi_bus->active_devices++;

    return MP_OBJ_FROM_PTR(self);
}

spi_host_device_t machine_hw_spi_get_host(mp_obj_t in) {
    if (mp_obj_get_type(in) != &machine_spi_type) {
        mp_raise_ValueError(MP_ERROR_TEXT("expecting a SPI object"));
    }
    machine_hw_spi_obj_t *self = (machine_hw_spi_obj_t *)in;
    return self->spi_bus->host;
}

static const mp_machine_spi_p_t machine_hw_spi_p = {
    .init = machine_hw_spi_init,
    .deinit = machine_hw_spi_deinit,
    .transfer = machine_hw_spi_transfer,
};

MP_DEFINE_CONST_OBJ_TYPE(
    machine_spi_type,
    MP_QSTR_SPI,
    MP_TYPE_FLAG_NONE,
    make_new, machine_hw_spi_make_new,
    print, machine_hw_spi_print,
    protocol, &machine_hw_spi_p,
    locals_dict, &mp_machine_spi_locals_dict
    );